vacancies = [
    {'Должность': 'Менеджер по продажам', 'Необходимый стаж(лет работы)': 2, 'Пол': 'Любой', 'Образование': 'высшее', 'Минимальный возраст(годы)': 21, 'Максимальный возраст(годы)': 35, 'Знание иностранных языков': 'английский', 'Минимальный оклад(рублей)': 30000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'HR-менеджер', 'Необходимый стаж(лет работы)': 3, 'Пол': 'Любой', 'Образование': 'высшее', 'Минимальный возраст(годы)': 23, 'Максимальный возраст(годы)': 40, 'Знание иностранных языков': 'французский', 'Минимальный оклад(рублей)': 40000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 6},
    {'Должность': 'Программист', 'Необходимый стаж(лет работы)': 5, 'Пол': 'Мужской', 'Образование': 'высшее', 'Минимальный возраст(годы)': 25, 'Максимальный возраст(годы)': 45, 'Знание иностранных языков': 'немецкий', 'Минимальный оклад(рублей)': 50000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Бухгалтер','Необходимый стаж(лет работы)': 4, 'Пол': 'Любой', 'Образование': 'Высшее экономическое', 'Минимальный возраст(годы)': '30 лет',  'Максимальный возраст(годы)': 60, 'Знание иностранных языков': 'Английский (средний уровень)', 'Минимальный оклад(рублей)': 90000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 6},
    {'Должность': 'Медицинская сестра', 'Необходимый стаж(лет работы)': 3, 'Пол': 'Женский','Образование': 'Среднее медицинское','Минимальный возраст(годы)': 25 ,'Максимальный возраст(годы)': 55,'Знание иностранных языков': 'Не требуется','Минимальный оклад(рублей)': 60000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Адвокат', 'Необходимый стаж(лет работы)': 5, 'Пол': 'Любой', 'Образование': 'Высшее юридическое', 'Минимальный возраст(годы)': '30 лет', 'Максимальный возраст(годы)': 65, 'Знание иностранных языков': 'Английский (продвинутый уровень)', 'Минимальный оклад(рублей)': 100000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 6},
    {'Должность': 'Учитель начальных классов','Необходимый стаж(лет работы)': 2, 'Пол': 'Женский', 'Образование': 'Высшее педагогическое', 'Минимальный возраст(годы)': 25, 'Максимальный возраст(годы)': 55, 'Знание иностранных языков': 'Не требуется', 'Минимальный оклад(рублей)': 55000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Механик','Необходимый стаж(лет работы)': 3, 'Пол': 'Любой', 'Образование': 'Среднее профессиональное', 'Минимальный возраст(годы)': 24, 'Максимальный возраст(годы)': 58, 'Знание иностранных языков': 'Не требуется', 'Минимальный оклад(рублей)': 60000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 4},
    {'Должность': 'Швея', 'Необходимый стаж(лет работы)': 2, 'Пол': 'Женский', 'Образование': 'Среднее профессиональное', 'Минимальный возраст(годы)': 23, 'Максимальный возраст(годы)': 50, 'Знание иностранных языков': 'Не требуется', 'Минимальный оклад(рублей)': 48000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Архитектор', 'Необходимый стаж(лет работы)': 5, 'Пол': 'Любой', 'Образование': 'Высшее архитектурное', 'Минимальный возраст(годы)': 28, 'Максимальный возраст(годы)': 60, 'Знание иностранных языков': 'Английский (средний уровень)', 'Минимальный оклад(рублей)': 90000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 5},
    {'Должность': 'Менеджер по продажам', 'Необходимый стаж(лет работы)': 3, 'Пол': 'Любой', 'Образование': 'Высшее экономическое или коммерческое', 'Минимальный возраст(годы)': 25, 'Максимальный возраст(годы)': 50, 'Знание иностранных языков': 'Английский (разговорный уровень)', 'Минимальный оклад(рублей)': 70000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Финансовый аналитик', 'Необходимый стаж(лет работы)': 2, 'Пол': 'Любой', 'Образование': 'Высшее экономическое', 'Минимальный возраст(годы)': 24, 'Максимальный возраст(годы)': 55, 'Знание иностранных языков': 'Английский (продвинутый уровень)', 'Минимальный оклад(рублей)': 80000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 4},
    {'Должность': 'Инженер-программист', 'Необходимый стаж(лет работы)': 2, 'Пол': 'Любой', 'Образование': 'Высшее техническое', 'Минимальный возраст(годы)': 23, 'Максимальный возраст(годы)': 50, 'Знание иностранных языков': 'Английский (продвинутый уровень)', 'Минимальный оклад(рублей)': 75000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 4},
    {'Должность': 'Медсестра', 'Необходимый стаж(лет работы)': 2, 'Пол': 'Женский', 'Образование': 'Среднее медицинское', 'Минимальный возраст(годы)': 22, 'Максимальный возраст(годы)': 55, 'Знание иностранных языков': 'Не требуется', 'Минимальный оклад(рублей)': 40000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Разработчик веб-приложений', 'Необходимый стаж(лет работы)': 3, 'Пол': 'Любой', 'Образование': 'Высшее техническое или информационные технологии', 'Минимальный возраст(годы)': 24, 'Максимальный возраст(годы)': 50, 'Знание иностранных языков': 'Английский (продвинутый уровень)', 'Минимальный оклад(рублей)': 85000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Специалист по маркетингу', 'Необходимый стаж(лет работы)': 2, 'Пол': 'не имеет значения', 'Образование': 'высшее образование в области маркетинга или экономики', 'Минимальный возраст(годы)': 25, 'Максимальный возраст(годы)': 'не ограничено', 'Знание иностранных языков': 'английский - свободное владение', 'Минимальный оклад(рублей)': 50000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Программист', 'Необходимый стаж(лет работы)': 3, 'Пол': 'не имеет значения', 'Образование': 'высшее образование в области информационных технологий или компьютерных наук', 'Минимальный возраст(годы)': 22, 'Максимальный возраст(годы)': 'не ограничено', 'Знание иностранных языков': 'английский - технический перевод', 'Минимальный оклад(рублей)': 70000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 2},
    {'Должность': 'Медицинская сестра', 'Необходимый стаж(лет работы)': 1, 'Пол': 'женский', 'Образование': 'медицинское', 'Минимальный возраст(годы)': 21, 'Максимальный возраст(годы)': 55, 'Знание иностранных языков': 'не требуется', 'Минимальный оклад(рублей)': 40000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Адвокат', 'Необходимый стаж(лет работы)': 5, 'Пол': 'не имеет значения', 'Образование': 'высшее юридическое образование' ,'Минимальный возраст(годы)': 30, 'Максимальный возраст(годы)': 60, 'Знание иностранных языков': 'английский - свободное владение', 'Минимальный оклад(рублей)': 80000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 6},
    {'Должность': 'Бухгалтер', 'Необходимый стаж(лет работы)': 3, 'Пол': 'не имеет значения', 'Образование': 'высшее образование в области бухгалтерского учета или экономики', 'Минимальный возраст(годы)': 23, 'Максимальный возраст(годы)': 55, 'Знание иностранных языков': 'не требуется', 'Минимальный оклад(рублей)': 55000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Инженер-конструктор', 'Необходимый стаж(лет работы)': 2, 'Пол': 'не имеет значения', 'Образование': 'высшее техническое образование', 'Минимальный возраст(годы)': 24, 'Максимальный возраст(годы)': 65, 'Знание иностранных языков': 'английский - технический перевод', 'Минимальный оклад(рублей)': 60000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Менеджер по продажам', 'Необходимый стаж(лет работы)': 2, 'Пол': 'не имеет значения', 'Образование': 'высшее образование в области маркетинга или экономики', 'Минимальный возраст(годы)': 25, 'Максимальный возраст(годы)': 45, 'Знание иностранных языков': 'английский - свободное владение', 'Минимальный оклад(рублей)': 50000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Учитель начальных классов', 'Необходимый стаж(лет работы)': 3, 'Пол': 'не имеет значения', 'Образование': 'педагогическое образование', 'Минимальный возраст(годы)': 30, 'Максимальный возраст(годы)': 65, 'Знание иностранных языков': 'не требуется', 'Минимальный оклад(рублей)': 45000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3},
    {'Должность': 'Инфограф', 'Необходимый стаж(лет работы)': 2, 'Пол': 'не имеет значения', 'Образование': 'высшее образование в области дизайна или искусств', 'Минимальный возраст(годы)': 23, 'Максимальный возраст(годы)': 55, 'Знание иностранных языков': 'английский - свободное владение', 'Минимальный оклад(рублей)': 55000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 2},
    {'Должность': 'Веб-разработчик', 'Необходимый стаж(лет работы)': 2, 'Пол': 'не имеет значения', 'Образование': 'высшее образование в области информационных технологий или компьютерных наук', 'Минимальный возраст(годы)': 24, 'Максимальный возраст(годы)': 50, 'Знание иностранных языков': 'английский - технический перевод', 'Минимальный оклад(рублей)': 60000, 'Наличие соцпакета': True, 'Испытательный срок(месяцев)': 3}
]

class Vacancy:
    def __init__(self, position, experience, gender, education, min_age, max_age, languages, salary, social_package,
                 probation_period):
        self.position = position
        self.experience = experience
        self.gender = gender
        self.education = education
        self.min_age = min_age
        self.max_age = max_age
        self.languages = languages
        self.salary = salary
        self.social_package = social_package
        self.probation_period = probation_period


class RecruitmentAgency:
    def __init__(self):
        self.vacancies = []

    def add_vacancy(self, vacancy):
        self.vacancies.append(vacancy)

    def remove_vacancy(self, position):
        for vacancy in self.vacancies:
            if vacancy.position == position:
                self.vacancies.remove(vacancy)
                break

    def show_all_vacancies(self):
        for vacancy in self.vacancies:
            print(vacancy.position)

    def create_full_vacancy_list_report(self):
        sorted_vacancies = sorted(self.vacancies, key=lambda v: (v.education, v.position))
        for vacancy in sorted_vacancies:
            print(vacancy.position)

    def create_vacancy_with_probation_report(self, probation):
        filtered_vacancies = [vacancy for vacancy in self.vacancies if vacancy.probation_period >= probation]
        sorted_vacancies = sorted(filtered_vacancies, key=lambda v: (v.probation_period, v.experience, v.max_age))
        for vacancy in sorted_vacancies:
            print(vacancy.position)

    def create_vacancy_with_salary_report(self, min_salary, max_salary):
        filtered_vacancies = [vacancy for vacancy in self.vacancies if min_salary <= vacancy.salary <= max_salary]
        sorted_vacancies = sorted(filtered_vacancies, key=lambda v: (v.social_package, v.probation_period))
        for vacancy in sorted_vacancies:
            print(vacancy.position)


# Создание базы вакансий
recruitment_agency = RecruitmentAgency()
# Добавление записей в базу
# ...

# Пример взаимодействия с базой данных через дружественный интерфейс
while True:
    print("1. Добавить вакансию")
    print("2. Удалить вакансию")
    print("3. Вывести все вакансии")
    print("4. Полный список всех вакансий")
    print("5. Список всех вакансий с определенным испытательным сроком")
    print("6. Список всех вакансий с окладом в определенном диапазоне")
    print("7. Выход")

    choice = input("Выберите действие: ")

    if choice == "1":
        recruitment_agency.add_vacancy()
    # Добавление вакансии
    # ...
    elif choice == "2":
        recruitment_agency.remove_vacancy()
    # Удаление вакансии
    # ...
    elif choice == "3":
        recruitment_agency.show_all_vacancies()
    elif choice == "4":
        recruitment_agency.create_full_vacancy_list_report()
    elif choice == "5":
        probation = int(input("Введите минимальный испытательный срок: "))
        recruitment_agency.create_vacancy_with_probation_report(probation)
    elif choice == "6":
        min_salary = int(input("Введите минимальный оклад: "))
        max_salary = int(input("Введите максимальный оклад: "))
        recruitment_agency.create_vacancy_with_salary_report(min_salary, max_salary)
    elif choice == "7":
        break
    else:
        print("Некорректный ввод")
